tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1507_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1507_H_
#define _PIC16LF1507_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define ADIF                          59
#define TMR1GIF                       60
#define PIR2                          61
#define NCO1IF                        62
#define PIR3                          63
#define CLC1IF                        64
#define CLC2IF                        65
#define TMR0                          66
#define TMR1L                         67
#define TMR1H                         68
#define T1CON                         69
#define TMR1ON                        70
#define nT1SYNC                       71
#define T1OSCEN                       72
#define T1CKPS0                       73
#define T1CKPS                        74
#define T1CKPS1                       75
#define TMR1CS0                       76
#define TMR1CS                        77
#define TMR1CS1                       78
#define T1GCON                        79
#define T1GSS0                        80
#define T1GSS                         81
#define T1GSS1                        82
#define T1GVAL                        83
#define T1GGO_nDONE                   84
#define T1GSPM                        85
#define T1GTM                         86
#define T1GPOL                        87
#define TMR1GE                        88
#define TMR2                          89
#define PR2                           90
#define T2CON                         91
#define T2CKPS0                       92
#define T2CKPS                        93
#define T2CKPS1                       94
#define TMR2ON                        95
#define TOUTPS0                       96
#define T2OUTPS                       97
#define TOUTPS1                       98
#define TOUTPS2                       99
#define TOUTPS3                       100
#define TRISA                         101
#define TRISA0                        102
#define TRISA1                        103
#define TRISA2                        104
#define TRISA3                        105
#define TRISA4                        106
#define TRISA5                        107
#define TRISB                         108
#define TRISB4                        109
#define TRISB5                        110
#define TRISB6                        111
#define TRISB7                        112
#define TRISC                         113
#define TRISC0                        114
#define TRISC1                        115
#define TRISC2                        116
#define TRISC3                        117
#define TRISC4                        118
#define TRISC5                        119
#define TRISC6                        120
#define TRISC7                        121
#define PIE1                          122
#define TMR1IE                        123
#define TMR2IE                        124
#define ADIE                          125
#define TMR1GIE                       126
#define PIE2                          127
#define NCO1IE                        128
#define PIE3                          129
#define CLC1IE                        130
#define CLC2IE                        131
#define OPTION_REG                    132
#define PS                            133
#define PS0                           134
#define PS1                           135
#define PS2                           136
#define PSA                           137
#define T0SE                          138
#define TMR0SE                        139
#define T0CS                          140
#define TMR0CS                        141
#define INTEDG                        142
#define nWPUEN                        143
#define PCON                          144
#define nBOR                          145
#define nPOR                          146
#define nRI                           147
#define nRMCLR                        148
#define nRWDT                         149
#define STKUNF                        150
#define STKOVF                        151
#define WDTCON                        152
#define SWDTEN                        153
#define WDTPS                         154
#define WDTPS0                        155
#define WDTPS1                        156
#define WDTPS2                        157
#define WDTPS3                        158
#define WDTPS4                        159
#define OSCCON                        160
#define SCS0                          161
#define SCS                           162
#define SCS1                          163
#define IRCF                          164
#define IRCF0                         165
#define IRCF1                         166
#define IRCF2                         167
#define IRCF3                         168
#define OSCSTAT                       169
#define HFIOFS                        170
#define LFIOFR                        171
#define HFIOFR                        172
#define OSTS                          173
#define SOSCR                         174
#define ADRESL                        175
#define ADRESH                        176
#define ADCON0                        177
#define ADON                          178
#define GO_nDONE                      179
#define GO                            180
#define ADGO                          181
#define CHS0                          182
#define CHS                           183
#define CHS1                          184
#define CHS2                          185
#define CHS3                          186
#define CHS4                          187
#define ADCON1                        188
#define ADPREF0                       189
#define ADPREF                        190
#define ADPREF1                       191
#define ADCS0                         192
#define ADCS                          193
#define ADCS1                         194
#define ADCS2                         195
#define ADFM                          196
#define ADCON2                        197
#define TRIGSEL                       198
#define TRIGSEL0                      199
#define TRIGSEL1                      200
#define TRIGSEL2                      201
#define TRIGSEL3                      202
#define LATA                          203
#define LATA0                         204
#define LATA1                         205
#define LATA2                         206
#define LATA4                         207
#define LATA5                         208
#define LATB                          209
#define LATB4                         210
#define LATB5                         211
#define LATB6                         212
#define LATB7                         213
#define LATC                          214
#define LATC0                         215
#define LATC1                         216
#define LATC2                         217
#define LATC3                         218
#define LATC4                         219
#define LATC5                         220
#define LATC6                         221
#define LATC7                         222
#define BORCON                        223
#define BORRDY                        224
#define BORFS                         225
#define SBOREN                        226
#define FVRCON                        227
#define ADFVR0                        228
#define ADFVR                         229
#define ADFVR1                        230
#define TSRNG                         231
#define TSEN                          232
#define FVRRDY                        233
#define FVREN                         234
#define APFCON                        235
#define NCO1SEL                       236
#define CLC1SEL                       237
#define ANSA0                         238
#define ANSELA                        239
#define ANSA1                         240
#define ANSA2                         241
#define ANSA4                         242
#define ANSELB                        243
#define ANSB4                         244
#define ANSB5                         245
#define ANSC0                         246
#define ANSELC                        247
#define ANSC1                         248
#define ANSC2                         249
#define ANSC3                         250
#define ANSC6                         251
#define ANSC7                         252
#define PMADRL                        253
#define PMADRH                        254
#define PMDATL                        255
#define PMDATH                        256
#define PMCON1                        257
#define RD                            258
#define WR                            259
#define WREN                          260
#define WRERR                         261
#define FREE                          262
#define LWLO                          263
#define CFGS                          264
#define PMCON2                        265
#define WPUA0                         266
#define WPUA                          267
#define WPUA1                         268
#define WPUA2                         269
#define WPUA3                         270
#define WPUA4                         271
#define WPUA5                         272
#define WPUB                          273
#define WPUB4                         274
#define WPUB5                         275
#define WPUB6                         276
#define WPUB7                         277
#define IOCAP                         278
#define IOCAP0                        279
#define IOCAP1                        280
#define IOCAP2                        281
#define IOCAP3                        282
#define IOCAP4                        283
#define IOCAP5                        284
#define IOCAN0                        285
#define IOCAN                         286
#define IOCAN1                        287
#define IOCAN2                        288
#define IOCAN3                        289
#define IOCAN4                        290
#define IOCAN5                        291
#define IOCAF0                        292
#define IOCAF                         293
#define IOCAF1                        294
#define IOCAF2                        295
#define IOCAF3                        296
#define IOCAF4                        297
#define IOCAF5                        298
#define IOCBP                         299
#define IOCBP4                        300
#define IOCBP5                        301
#define IOCBP6                        302
#define IOCBP7                        303
#define IOCBN4                        304
#define IOCBN                         305
#define IOCBN5                        306
#define IOCBN6                        307
#define IOCBN7                        308
#define IOCBF4                        309
#define IOCBF                         310
#define IOCBF5                        311
#define IOCBF6                        312
#define IOCBF7                        313
#define NCO1ACCL                      314
#define NCO1ACC0                      315
#define NCO1ACC1                      316
#define NCO1ACC2                      317
#define NCO1ACC3                      318
#define NCO1ACC4                      319
#define NCO1ACC5                      320
#define NCO1ACC6                      321
#define NCO1ACC7                      322
#define NCO1ACCH                      323
#define NCO1ACC8                      324
#define NCO1ACC9                      325
#define NCO1ACC10                     326
#define NCO1ACC11                     327
#define NCO1ACC12                     328
#define NCO1ACC13                     329
#define NCO1ACC14                     330
#define NCO1ACC15                     331
#define NCO1ACCU                      332
#define NCO1ACC16                     333
#define NCO1ACC17                     334
#define NCO1ACC18                     335
#define NCO1ACC19                     336
#define NCO1INCL                      337
#define NCO1INC0                      338
#define NCO1INC1                      339
#define NCO1INC2                      340
#define NCO1INC3                      341
#define NCO1INC4                      342
#define NCO1INC5                      343
#define NCO1INC6                      344
#define NCO1INC7                      345
#define NCO1INCH                      346
#define NCO1INC8                      347
#define NCO1INC9                      348
#define NCO1INC10                     349
#define NCO1INC11                     350
#define NCO1INC12                     351
#define NCO1INC13                     352
#define NCO1INC14                     353
#define NCO1INC15                     354
#define NCO1CON                       355
#define N1PFM                         356
#define N1POL                         357
#define N1OUT                         358
#define N1OE                          359
#define N1EN                          360
#define NCO1CLK                       361
#define N1CKS                         362
#define N1CKS0                        363
#define N1CKS1                        364
#define N1PWS0                        365
#define N1PWS                         366
#define N1PWS1                        367
#define N1PWS2                        368
#define PWM1DCL                       369
#define PWM1DCL0                      370
#define PWM1DCL1                      371
#define PWM1DCH                       372
#define PWM1DCH0                      373
#define PWM1DCH1                      374
#define PWM1DCH2                      375
#define PWM1DCH3                      376
#define PWM1DCH4                      377
#define PWM1DCH5                      378
#define PWM1DCH6                      379
#define PWM1DCH7                      380
#define PWM1CON                       381
#define PWM1POL                       382
#define PWM1OUT                       383
#define PWM1OE                        384
#define PWM1EN                        385
#define PWM2DCL0                      386
#define PWM2DCL                       387
#define PWM2DCL1                      388
#define PWM2DCH0                      389
#define PWM2DCH                       390
#define PWM2DCH1                      391
#define PWM2DCH2                      392
#define PWM2DCH3                      393
#define PWM2DCH4                      394
#define PWM2DCH5                      395
#define PWM2DCH6                      396
#define PWM2DCH7                      397
#define PWM2CON                       398
#define PWM2POL                       399
#define PWM2OUT                       400
#define PWM2OE                        401
#define PWM2EN                        402
#define PWM3DCL0                      403
#define PWM3DCL                       404
#define PWM3DCL1                      405
#define PWM3DCH0                      406
#define PWM3DCH                       407
#define PWM3DCH1                      408
#define PWM3DCH2                      409
#define PWM3DCH3                      410
#define PWM3DCH4                      411
#define PWM3DCH5                      412
#define PWM3DCH6                      413
#define PWM3DCH7                      414
#define PWM3CON                       415
#define PWM3POL                       416
#define PWM3OUT                       417
#define PWM3OE                        418
#define PWM3EN                        419
#define PWM4DCL                       420
#define PWM4DCL0                      421
#define PWM4DCL1                      422
#define PWM4DCH0                      423
#define PWM4DCH                       424
#define PWM4DCH1                      425
#define PWM4DCH2                      426
#define PWM4DCH3                      427
#define PWM4DCH4                      428
#define PWM4DCH5                      429
#define PWM4DCH6                      430
#define PWM4DCH7                      431
#define PWM4CON                       432
#define PWM4POL                       433
#define PWM4OUT                       434
#define PWM4OE                        435
#define PWM4EN                        436
#define CWG1DBR0                      437
#define CWG1DBR                       438
#define CWG1DBR1                      439
#define CWG1DBR2                      440
#define CWG1DBR3                      441
#define CWG1DBR4                      442
#define CWG1DBR5                      443
#define CWG1DBF                       444
#define CWG1DBF0                      445
#define CWG1DBF1                      446
#define CWG1DBF2                      447
#define CWG1DBF3                      448
#define CWG1DBF4                      449
#define CWG1DBF5                      450
#define CWG1CON0                      451
#define G1CS0                         452
#define G1CS                          453
#define G1POLA                        454
#define G1POLB                        455
#define G1OEA                         456
#define G1OEB                         457
#define G1EN                          458
#define CWG1CON1                      459
#define G1IS0                         460
#define G1IS                          461
#define G1IS1                         462
#define G1IS2                         463
#define G1ASDLA                       464
#define G1ASDLA0                      465
#define G1ASDLA1                      466
#define G1ASDLB                       467
#define G1ASDLB0                      468
#define G1ASDLB1                      469
#define CWG1CON2                      470
#define G1ASDSCLC2                    471
#define G1ASDSFLT                     472
#define G1ARSEN                       473
#define G1ASE                         474
#define CLCDATA                       475
#define MCLC1OUT                      476
#define MCLC2OUT                      477
#define CLC1CON                       478
#define LC1MODE0                      479
#define LC1MODE                       480
#define CLC1CON_LCMODE0               481
#define LC1MODE1                      482
#define CLC1CON_LCMODE1               483
#define CLC1CON_LCMODE2               484
#define LC1MODE2                      485
#define LC1INTN                       486
#define CLC1CON_LCINTN                487
#define LC1INTP                       488
#define CLC1CON_LCINTP                489
#define CLC1CON_LCOUT                 490
#define LC1OUT                        491
#define LC1OE                         492
#define CLC1CON_LCOE                  493
#define LC1EN                         494
#define CLC1CON_LCEN                  495
#define CLC1POL                       496
#define LC1G1POL                      497
#define CLC1POL_G1POL                 498
#define CLC1POL_G2POL                 499
#define LC1G2POL                      500
#define LC1G3POL                      501
#define CLC1POL_G3POL                 502
#define LC1G4POL                      503
#define CLC1POL_G4POL                 504
#define CLC1POL_POL                   505
#define LC1POL                        506
#define CLC1SEL0                      507
#define LC1D1S                        508
#define CLC1SEL0_D1S0                 509
#define LC1D1S0                       510
#define CLC1SEL0_D1S1                 511
#define LC1D1S1                       512
#define CLC1SEL0_D1S2                 513
#define LC1D1S2                       514
#define LC1D2S                        515
#define LC1D2S0                       516
#define CLC1SEL0_D2S0                 517
#define LC1D2S1                       518
#define CLC1SEL0_D2S1                 519
#define LC1D2S2                       520
#define CLC1SEL0_D2S2                 521
