tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1507_tdd.h
#define CLC1SEL1                      522
#define LC1D3S0                       523
#define CLC1SEL1_D3S0                 524
#define LC1D3S                        525
#define LC1D3S1                       526
#define CLC1SEL1_D3S1                 527
#define LC1D3S2                       528
#define CLC1SEL1_D3S2                 529
#define LC1D4S                        530
#define LC1D4S0                       531
#define CLC1SEL1_D4S0                 532
#define LC1D4S1                       533
#define CLC1SEL1_D4S1                 534
#define LC1D4S2                       535
#define CLC1SEL1_D4S2                 536
#define CLC1GLS0                      537
#define CLC1GLS0_D1N                  538
#define LC1G1D1N                      539
#define CLC1GLS0_D1T                  540
#define LC1G1D1T                      541
#define LC1G1D2N                      542
#define CLC1GLS0_D2N                  543
#define LC1G1D2T                      544
#define CLC1GLS0_D2T                  545
#define CLC1GLS0_D3N                  546
#define LC1G1D3N                      547
#define CLC1GLS0_D3T                  548
#define LC1G1D3T                      549
#define CLC1GLS0_D4N                  550
#define LC1G1D4N                      551
#define CLC1GLS0_D4T                  552
#define LC1G1D4T                      553
#define CLC1GLS1                      554
#define CLC1GLS1_D1N                  555
#define LC1G2D1N                      556
#define LC1G2D1T                      557
#define CLC1GLS1_D1T                  558
#define CLC1GLS1_D2N                  559
#define LC1G2D2N                      560
#define LC1G2D2T                      561
#define CLC1GLS1_D2T                  562
#define CLC1GLS1_D3N                  563
#define LC1G2D3N                      564
#define LC1G2D3T                      565
#define CLC1GLS1_D3T                  566
#define CLC1GLS1_D4N                  567
#define LC1G2D4N                      568
#define LC1G2D4T                      569
#define CLC1GLS1_D4T                  570
#define CLC1GLS2                      571
#define CLC1GLS2_D1N                  572
#define LC1G3D1N                      573
#define LC1G3D1T                      574
#define CLC1GLS2_D1T                  575
#define LC1G3D2N                      576
#define CLC1GLS2_D2N                  577
#define LC1G3D2T                      578
#define CLC1GLS2_D2T                  579
#define CLC1GLS2_D3N                  580
#define LC1G3D3N                      581
#define LC1G3D3T                      582
#define CLC1GLS2_D3T                  583
#define LC1G3D4N                      584
#define CLC1GLS2_D4N                  585
#define LC1G3D4T                      586
#define CLC1GLS2_D4T                  587
#define CLC1GLS3                      588
#define LC1G4D1N                      589
#define CLC1GLS3_G4D1N                590
#define LC1G4D1T                      591
#define CLC1GLS3_G4D1T                592
#define CLC1GLS3_G4D2N                593
#define LC1G4D2N                      594
#define CLC1GLS3_G4D2T                595
#define LC1G4D2T                      596
#define LC1G4D3N                      597
#define CLC1GLS3_G4D3N                598
#define LC1G4D3T                      599
#define CLC1GLS3_G4D3T                600
#define CLC1GLS3_G4D4N                601
#define LC1G4D4N                      602
#define CLC1GLS3_G4D4T                603
#define LC1G4D4T                      604
#define CLC2CON                       605
#define LC2MODE0                      606
#define LC2MODE                       607
#define CLC2CON_LCMODE0               608
#define LC2MODE1                      609
#define CLC2CON_LCMODE1               610
#define LC2MODE2                      611
#define CLC2CON_LCMODE2               612
#define LC2INTN                       613
#define CLC2CON_LCINTN                614
#define LC2INTP                       615
#define CLC2CON_LCINTP                616
#define CLC2CON_LCOUT                 617
#define LC2OUT                        618
#define LC2OE                         619
#define CLC2CON_LCOE                  620
#define CLC2CON_LCEN                  621
#define LC2EN                         622
#define CLC2POL                       623
#define LC2G1POL                      624
#define CLC2POL_G1POL                 625
#define LC2G2POL                      626
#define CLC2POL_G2POL                 627
#define LC2G3POL                      628
#define CLC2POL_G3POL                 629
#define LC2G4POL                      630
#define CLC2POL_G4POL                 631
#define CLC2POL_POL                   632
#define LC2POL                        633
#define CLC2SEL0                      634
#define LC2D1S0                       635
#define CLC2SEL0_D1S0                 636
#define LC2D1S                        637
#define LC2D1S1                       638
#define CLC2SEL0_D1S1                 639
#define LC2D1S2                       640
#define CLC2SEL0_D1S2                 641
#define LC2D2S0                       642
#define LC2D2S                        643
#define CLC2SEL0_D2S0                 644
#define LC2D2S1                       645
#define CLC2SEL0_D2S1                 646
#define LC2D2S2                       647
#define CLC2SEL0_D2S2                 648
#define CLC2SEL1                      649
#define CLC2SEL1_D3S0                 650
#define LC2D3S0                       651
#define LC2D3S                        652
#define LC2D3S1                       653
#define CLC2SEL1_D3S1                 654
#define LC2D3S2                       655
#define CLC2SEL1_D3S2                 656
#define LC2D4S                        657
#define LC2D4S0                       658
#define CLC2SEL1_D4S0                 659
#define LC2D4S1                       660
#define CLC2SEL1_D4S1                 661
#define LC2D4S2                       662
#define CLC2SEL1_D4S2                 663
#define CLC2GLS0                      664
#define LC2G1D1N                      665
#define CLC2GLS0_D1N                  666
#define CLC2GLS0_D1T                  667
#define LC2G1D1T                      668
#define LC2G1D2N                      669
#define CLC2GLS0_D2N                  670
#define CLC2GLS0_D2T                  671
#define LC2G1D2T                      672
#define LC2G1D3N                      673
#define CLC2GLS0_D3N                  674
#define CLC2GLS0_D3T                  675
#define LC2G1D3T                      676
#define LC2G1D4N                      677
#define CLC2GLS0_D4N                  678
#define CLC2GLS0_D4T                  679
#define LC2G1D4T                      680
#define CLC2GLS1                      681
#define CLC2GLS1_D1N                  682
#define LC2G2D1N                      683
#define CLC2GLS1_D1T                  684
#define LC2G2D1T                      685
#define CLC2GLS1_D2N                  686
#define LC2G2D2N                      687
#define CLC2GLS1_D2T                  688
#define LC2G2D2T                      689
#define LC2G2D3N                      690
#define CLC2GLS1_D3N                  691
#define LC2G2D3T                      692
#define CLC2GLS1_D3T                  693
#define LC2G2D4N                      694
#define CLC2GLS1_D4N                  695
#define LC2G2D4T                      696
#define CLC2GLS1_D4T                  697
#define CLC2GLS2                      698
#define LC2G3D1N                      699
#define CLC2GLS2_D1N                  700
#define CLC2GLS2_D1T                  701
#define LC2G3D1T                      702
#define CLC2GLS2_D2N                  703
#define LC2G3D2N                      704
#define LC2G3D2T                      705
#define CLC2GLS2_D2T                  706
#define CLC2GLS2_D3N                  707
#define LC2G3D3N                      708
#define CLC2GLS2_D3T                  709
#define LC2G3D3T                      710
#define CLC2GLS2_D4N                  711
#define LC2G3D4N                      712
#define LC2G3D4T                      713
#define CLC2GLS2_D4T                  714
#define CLC2GLS3                      715
#define LC2G4D1N                      716
#define CLC2GLS3_G4D1N                717
#define CLC2GLS3_G4D1T                718
#define LC2G4D1T                      719
#define CLC2GLS3_G4D2N                720
#define LC2G4D2N                      721
#define LC2G4D2T                      722
#define CLC2GLS3_G4D2T                723
#define CLC2GLS3_G4D3N                724
#define LC2G4D3N                      725
#define CLC2GLS3_G4D3T                726
#define LC2G4D3T                      727
#define LC2G4D4N                      728
#define CLC2GLS3_G4D4N                729
#define CLC2GLS3_G4D4T                730
#define LC2G4D4T                      731
#define BSR_ICDSHAD                   732
#define STATUS_SHAD                   733
#define C_SHAD                        734
#define DC_SHAD                       735
#define Z_SHAD                        736
#define WREG_SHAD                     737
#define BSR_SHAD                      738
#define PCLATH_SHAD                   739
#define FSR0L_SHAD                    740
#define FSR0H_SHAD                    741
#define FSR1L_SHAD                    742
#define FSR1H_SHAD                    743
#define STKPTR                        744
#define TOSL                          745
#define TOSH                          746

#endif // _PIC16LF1507_H_
